Repository: azzuwayed/WC-Remote-Products-Display
Catalog: languages/wcrpd-*.po
Languages: ar

source: Abdullah Alzuwayed
ar: عبدالله الزويد

source: Advanced Settings (beta)
ar: إعدادات متقدمة (ميزة تجريبية)

source: All cache and transients have been flushed. First page load will be slower in order to cache the initial request.
ar: تم مسح ذاكرة التخزين المؤقتة. سيكون تحميل الصفحة الأولى أبطأ من أجل تخزين ذاكرة مؤقتة جديدة.

source: All options and cache have been reset. First page load will be slower in order to cache the initial request.
ar: تمت إعادة ضبط جميع الخيارات وذاكرة التخزين المؤقتة. سيكون تحميل الصفحة الأولى أبطأ من أجل تخزين ذاكرة مؤقتة جديدة.

source: An error occurred while processing your request. Please check your API credentials and ensure your WooCommerce store is accessible.
ar: حدث خطأ أثناء معالجة طلبك. يرجى التحقق من مفاتيح API والتأكد من إمكانية الوصول إلى متجر WooCommerce.

source: API Connection
ar: اتصال API

source: API Connection failed
ar: فشل اتصال API

source: API connection failed
ar: فشل اتصال API

source: API Connection is successful
ar: تم بنجاح اتصال API

source: Button
ar: زر الرابط

source: Cache Duration
ar: مدة ذاكرة التخزين المؤقت

source: Category
ar: التصنيف

source: Category IDs
ar: رقم التصنيف

source: Category:
ar: التصنيف:

source: Choose which product elements you would like to display on the card.
ar: اختر العناصر التي ترغب في عرضها على بطاقة المنتج.

source: Consumer Key:
ar: مفتاح Consumer Key:

source: Consumer Secret:
ar: مفتاح Consumer Secret:

source: Count limit (beta)
ar: عدد المنتجات (ميزة تجريبية)

source: Debug Mode
ar: وضع إصلاح المشاكل

source: Debug Settings
ar: إصلاح المشاكل

source: Description
ar: الوصف

source: Display Settings
ar: إعدادات العرض

source: Enabled
ar: تفعيل

source: Example: <b>[wcrpd count_limit="6" filtered_categories="1,2,3"]</b> will apply both.
ar: مثال: <b>[wcrpd count_limit="6" filtered_categories="1,2,3"]</b> سيطبق كليهما.

source: Example: <b>[wcrpd count_limit="6"]</b> will display a maximum of 6 products.
ar: مثال: <b>[wcrpd count_limit="6"]</b> سيعرض 6 منتجات كحد أقصى.

source: Example: <b>[wcrpd filtered_categories="1,2,3"]</b> will display products from these categories.
ar: مثال: <b>[wcrpd filtered_categories="1,2,3"]</b> سيعرض منتجات من التصنيفات المحددة.

source: Fetched Categories
ar: التصنيفات التي تم جلبها

source: Filtered categories (beta)
ar: تصفية التصنيفات (ميزة تجريبية)

source: Flush Cache
ar: مسح الذاكرة المؤقتة

source: Frequent API calls may overload the server. Long cache might serve outdated data. Cache is shared between users and saved in your database. (default is 6 hours = 21600 seconds)
ar: نقص المدة قد يؤدي اتصالات API متكررة وزيادة الضغط على الموقع. زيادة المدة قد يعرض بيانات قديمة وغير محدثة. ذاكرة التخزين المؤقتة مشتركة بين الزوار ويتم حفظها في قاعدة البيانات مرة واحدة. (الافتراضي 6 ساعات = 21600 ثانية)

source: Global Display Settings
ar: إعدادات العرض العامة

source: Go to WC Remote Products Display settings
ar: الذهاب إلى إعدادات عرض منتجات ووكومرس عن بعد (WCRPD)

source: Here you should see the fetched categories from your remote website as [Category Name: Category ID]:
ar: هنا تظهر التصنيفات التي تم جلبها من موقع ووكومرس البعيد كـ [اسم التصنيف: رقم التصنيف]:

source: Higher limits can exceed the API's allowance, leading to a ban. (default is 30 per minute)
ar: زيادة عدد الاتصالات قد يؤدي إلى تتجاوز الحد الأعلى المسموح به لاتصالات (API) مما يؤدي إلى الحظر. (الافتراضي 30 في الدقيقة)

source: How many products to display per shortcode. This limit must be equal or greater than any shortcode, and not greater than available products on the remote website, otherwise you will get an error.
ar: كم عدد المنتجات التي سيتم عرضها لكل رمز قصير. يجب أن يكون هذا الحد مساويًا أو أكبر من أي رمز قصير، وليس أكبر من المنتجات المتاحة على موقع ووكومرس البعيد، وإلا فسوف تحصل على خطأ.

source: If attributes are not set, they will default to the global settings.
ar: إذا لم يتم تعيين السمات، فسيتم تعيينها افتراضيًا من الإعدادات العامة.

source: Image
ar: الصورة

source: Instructions:
ar: تعلميات:

source: Name
ar: العنوان

source: No categories found
ar: لم يتم إيجاد تصنيفات

source: No products found matching the criteria.
ar: لم يتم العثور على منتجات مطابقة للخيارات.

source: Only enable on development environment. Wordpress debug must be enabled for this to work. The debug includes errors and trivial data, and will make frontend errors more detailed.
ar: ينصح بالتفعيل في بيئة التطوير فقط، يجب تمكين تصحيح أخطاء Wordpress حتى تعمل هذه الميزة. عند التفعيل يتم تسجيل الأخطاء وبيانات إضافية، وسيجعل أخطاء الواجهة الأمامية أكثر تفصيلاً.

source: Price
ar: السعر

source: Product Card Elements
ar: عناصر بطاقة المنتج

source: Rate Limit
ar: حد تكرار الاتصال

source: Remote Prod Display WC plugin requires PHP 7.4 or newer.
ar: يتطلب عرض منتجات ووكومرس عن بعد (WCRPD) إلى نسخة PHP 7.4 أو أحدث.

source: Remote WooCommerce URL:
ar: رابط ووكومرس:

source: Reset Plugin
ar: إعادة الضبط

source: Save Changes
ar: حفظ التغييرات

source: Settings
ar: الإعدادات

source: Shop Now
ar: تسوق الآن

source: Short timeouts may result in errors, while long timeouts can slow down the user experience. (default is 10 seconds)
ar: قد يؤدي نقص مهلة الاتصال إلى حدوث أخطاء، بينما يمكن أن تؤدي زيادة مهلة الاتصال إلى إبطاء تجربة المستخدم. (الافتراضي 10 ثواني)

source: Showcase WooCommerce products on another WordPress website effortlessly. Configure your settings, and then use the `[wcrpd]` shortcode to display products in posts, pages, or widgets.
ar: اعرض منتجات WooCommerce على موقع WordPress آخر بسهولة. قم بتكوين إعداداتك، ثم استخدم الرمز القصير `[wcrpd]` لعرض المنتجات في المنشورات أو الصفحات أو عناصر واجهة المستخدم.

source: Timeout Duration
ar: مدة مهلة الاتصال

source: Use comma-separated IDs of the categories you want to include exclusivly. "Filtered categories" option must be enabled for this to work.
ar: استخدم معرفات مفصولة بالفاصلة الرقمية مثل 1,2,3 للتصنيفات التي تريد تضمينها حصريًا. يجب تمكين خيار "تصفية التصنيفات" حتى تعمل هذه الميزة.

source: Warning: adjusting these settings without understanding their impact can result in poor performance.
ar: تحذير: قد يؤدي ضبط هذه الإعدادات دون فهم تأثيرها إلى ضعف الأداء.

source: Warning: when this option is enabled, Category IDs become mandatory either in global or in shortcodes, otherwise you will get an error.
ar: تحذير: عند تمكين هذا الخيار، تصبح أرقام التصنيفات إلزامية سواء في الإعدادات العامة أو في الرموز القصيرة، وإلا فسوف تحصل على خطأ.

source: WC Remote Products Display
ar: عرض منتجات ووكومرس عن بعد (WCRPD)

source: You can override global settings with shortcode attributes.
ar: يمكنك تجاوز الإعدادات العامة باستخدام سمات الرمز القصير.
